 ## <center> Web Scraping Project 2.0 </center>

Displaying Top 10 Men's ODI cricket teams (Matches, Points, Ratings)

In [1]:
import pandas as pd
import requests
from bs4 import BeautifulSoup

In [2]:
url = "https://www.icc-cricket.com/rankings/mens/team-rankings/odi"
html_data = requests.get(url).text
odi_soup = BeautifulSoup(html_data, "html.parser")

In [3]:
odi_name = [tags.text for tags in odi_soup.select(".u-hide-phablet")]
odi_name = [tags.replace("\n", "") for tags in odi_name]
odi_name

['',
 'New Zealand',
 'England',
 'India',
 'Pakistan',
 'Australia',
 'South Africa',
 'Bangladesh',
 'Sri Lanka',
 'West Indies',
 'Afghanistan',
 'Ireland',
 'Scotland',
 'UAE',
 'Netherlands',
 'Zimbabwe',
 'Oman',
 'United States',
 'Namibia',
 'Nepal',
 'Papua New Guinea']

In [4]:
del odi_name[0]
del odi_name[10:]
odi_name

['New Zealand',
 'England',
 'India',
 'Pakistan',
 'Australia',
 'South Africa',
 'Bangladesh',
 'Sri Lanka',
 'West Indies',
 'Afghanistan']

In [5]:
odi_matche = [tags.text for tags in odi_soup.find(class_="rankings-block__banner--matches")]
odi_matche

['16']

In [6]:
odi_mtag = {"class":"table-body__cell u-center-text"}
odi_rmatch = [tags.text for tags in odi_soup.find_all("td", odi_mtag)]
del odi_rmatch[1::2]
del odi_rmatch[9:]
odi_rmatch

['27', '28', '19', '23', '21', '27', '29', '38', '18']

In [7]:
odi_match = odi_matche + odi_rmatch
odi_match

['16', '27', '28', '19', '23', '21', '27', '29', '38', '18']

In [8]:
odi_pot = [tags.text for tags in odi_soup.find(class_= "rankings-block__banner--points")]
odi_rpot = [tags.text for tags in odi_soup.find_all("td", odi_mtag)]
del odi_rpot[0::2]
del odi_rpot[9:]
odi_rpot

['3,226',
 '3,085',
 '2,005',
 '2,325',
 '2,111',
 '2,639',
 '2,658',
 '2,621',
 '1,238']

In [9]:
odi_points  = odi_pot+odi_rpot
odi_points

['2,051',
 '3,226',
 '3,085',
 '2,005',
 '2,325',
 '2,111',
 '2,639',
 '2,658',
 '2,621',
 '1,238']

In [10]:
odi_rat = [tags.text for tags in odi_soup.find(class_="rankings-block__banner--rating u-text-right")]
del odi_rat[1:]
odi_rat

['\n                            128\n                            ']

In [11]:
odi_rat = [tags.replace("\n", "").strip() for tags in odi_rat]
odi_rat

['128']

In [12]:
odi_rrat = [tags.text for tags in odi_soup.find_all(class_="table-body__cell u-text-right rating")]
del odi_rrat[9:]
odi_rrat

['119', '110', '106', '101', '101', '98', '92', '69', '69']

In [13]:
odi_ratings = odi_rat + odi_rrat
odi_ratings

['128', '119', '110', '106', '101', '101', '98', '92', '69', '69']

In [14]:
odi_teams = pd.DataFrame(odi_name, columns=["Team"], index=range(1,11))
odi_teams.rename_axis("POS", inplace=True)
odi_teams

             Team
POS
1     New Zealand
2         England
3           India
4        Pakistan
5       Australia
6    South Africa
7      Bangladesh
8       Sri Lanka
9     West Indies
10    Afghanistan

In [15]:
odi_match = pd.DataFrame(odi_match, columns=["Matches"], index=range(1,11))
odi_match.rename_axis("POS", inplace=True)
odi_match

    Matches
POS
1        16
2        27
3        28
4        19
5        23
6        21
7        27
8        29
9        38
10       18

In [16]:
odi_pr = pd.DataFrame(list(zip(odi_points, odi_ratings)), columns=["Points", "Ratings"], index=range(1,11))
odi_pr.rename_axis("POS", inplace=True)
odi_pr

    Points Ratings
POS
1    2,051     128
2    3,226     119
3    3,085     110
4    2,005     106
5    2,325     101
6    2,111     101
7    2,639      98
8    2,658      92
9    2,621      69
10   1,238      69

In [17]:
odi_mpr = pd.merge(odi_match, odi_pr, left_index = True, right_index= True)
odi_mpr

    Matches Points Ratings
POS
1        16  2,051     128
2        27  3,226     119
3        28  3,085     110
4        19  2,005     106
5        23  2,325     101
6        21  2,111     101
7        27  2,639      98
8        29  2,658      92
9        38  2,621      69
10       18  1,238      69

In [18]:
odi_top10 = pd.merge(odi_teams, odi_mpr, left_index=True, right_index=True)
odi_top10

             Team Matches Points Ratings
POS
1     New Zealand      16  2,051     128
2         England      27  3,226     119
3           India      28  3,085     110
4        Pakistan      19  2,005     106
5       Australia      23  2,325     101
6    South Africa      21  2,111     101
7      Bangladesh      27  2,639      98
8       Sri Lanka      29  2,658      92
9     West Indies      38  2,621      69
10    Afghanistan      18  1,238      69

In [19]:
odi_top10.to_csv("Top 10 Men's ODI Team.csv")